driver-tests/bpelse/assign/AssignIgnoreMissingFromData/src/AssignIMFD.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="AssignIMFD" targetNamespace="http://j2ee.netbeans.org/wsdl/AssignIMFD"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/AssignIMFD" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://xml.netbeans.org/schema/TestSchema">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/AssignIMFD" xmlns:ns1="http://xml.netbeans.org/schema/TestSchema">
            <xsd:import namespace="http://xml.netbeans.org/schema/TestSchema" schemaLocation="TestSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="AssignIMFDOperationRequest">
        <part name="Input" type="xsd:string"/>
    </message>
    <message name="AssignIMFDOperationResponse">
        <part name="Output" type="xsd:string"/>
    </message>
    <message name="TestMessage">
        <part name="TestPart" element="ns1:Message"/>
    </message>
    <portType name="AssignIMFDPortType">
        <operation name="AssignIMFDOperation">
            <input name="input1" message="tns:AssignIMFDOperationRequest"/>
            <output name="output1" message="tns:AssignIMFDOperationResponse"/>
        </operation>
    </portType>
    <binding name="AssignIMFDBinding" type="tns:AssignIMFDPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="AssignIMFDOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AssignIMFD"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AssignIMFD"/>
            </output>
        </operation>
    </binding>
    <service name="AssignIMFDService">
        <port name="AssignIMFDPort" binding="tns:AssignIMFDBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/AssignIMFDService/AssignIMFDPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="AssignIMFD">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="AssignIMFDPortTypeRole" portType="tns:AssignIMFDPortType"/>
    </plnk:partnerLinkType>
</definitions>
