driver-tests/bpelse/assign/AssignIgnoreMissingFromDataApp/test/TestVariousMissingDataAssigns/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ass="http://j2ee.netbeans.org/wsdl/AssignIMFD">
  <soapenv:Body>
    <ass:AssignIMFDOperation>
      <Input>Test Input</Input>
    </ass:AssignIMFDOperation>
  </soapenv:Body>
</soapenv:Envelope>